Revit 2027 API
BuiltInFailures.FamilyFailures.DummyHostMustBePerpendicularToXY Property
 Dummy host must be perpendicular to Z or Y axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DummyHostMustBePerpendicularToXY { get; }
Public Shared ReadOnly Property DummyHostMustBePerpendicularToXY As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DummyHostMustBePerpendicularToXY {
	FailureDefinitionId^ get ();
}
static member DummyHostMustBePerpendicularToXY : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace